// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Сопоставление букв анг.алфавита с таблицей ANCII. Цикл с вложенным условием
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int main() 
{
    char again = 'y';
    while (again == 'y') {
        cout << "**Вы отлично поиграли!**" << endl;;
        cout << "\n:Желаете продолжить? (y/n)" << endl;
        cin >> again;
    }

    cout << "\nOk, bay!" << endl;

    return 0;
}
// Output
// **Вы отлично поиграли!**
/*
:Желаете продолжить? (y/n)
m

Ok, bay!
*/
// Второй вариант реализации данного алгоритма
// do 
//	{
//		cout << "\n**Played an exciting game**";
//		cout << "\nDo you want to play again? (y/n): ";
//		cin >> again;
//	} while (again == 'y');
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
