// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Генератор 32-х битных случайных чисел.
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
#include <random>

int main() {
    using namespace std;
    random_device rd;
    mt19937 mersenne(rd()); // Инициализируем Вихрь Мерсенна случайным
    for (int count = 0; count < 8; ++count) {
        cout << mersenne() << "\t";
        // Разбивка на столбцы по пять
        if ((count + 1) % 5 == 0) {
            cout << "\n";
        }
    }
    return 0;
}
// Output:
/*
2
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//