// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Определение старшей цифры числа n, если его разрядность неизвестна
// Determination of the most significant digit of the number n, if its capacity is unknown
// Функция log10 вычисляет десятичный логарифм
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
#include <cmath> // Библиотека простых математических операций

int main() {
    using namespace std;
    auto n = 91546;
    double k = log10(n);
    k = k - floor(k);
    int result = pow(10, k);
    cout << "Result: " << result << endl;
    return 0;
}
// Output:
/*
Result: 9
0
*/
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//