// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// Пример ввода определённого количества чисел,
// вычисления суммы их значений в
// простом массиве.
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
#include <iostream>
using namespace std;

int sum = 0;

int main() {
  int arr[5];
  // Для ввода числа от пользователя
  for (int x = 0; x <= 4; ++x) {
    cout << "Enter num: " << endl;
    cin >> arr[x];
  }
  // Для вычесления суммы
  for (int i = 0; i <= 4 ; ++i) {
    sum += arr[i];
  }
  cout << sum << endl;

	return 0;
}
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=//
